In [1]:
import pandas as pd
import sqlite3 as sql
import pprint as print

In [3]:
db = sql.connect('fayllar/yangi.db')
cursor = db.cursor()

In [7]:
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
cursor.fetchall()

[('yonalish',), ('yonalishlar',), ('yonalish1',), ('aholi_soni',)]

In [9]:
pd.read_sql('SELECT * FROM aholi_soni;', db)

   rank      country    density  population  aria
0     1   Uzbekistan  1245.2568        36.0    44
1     2  Qirgiziston  7245.2568        16.0    23

In [18]:
query = "UPDATE aholi_soni SET rank= 35, density=421.2356 WHERE country='Qirgiziston';"
cursor.execute(query)
db.commit()

In [19]:
query = "SELECT * FROM aholi_soni;"
pd.read_sql(query, db)

   rank      country    density  population  aria
0     1   Uzbekistan  1245.2568        36.0    44
1    35  Qirgiziston   421.2356        16.0    23

In [21]:
query = "INSERT INTO aholi_soni  VALUES (21, 'Tajikistan', 124.1225,52.1,36);"
cursor.execute(query)
db.commit()

In [22]:
query = "SELECT * FROM aholi_soni;"
pd.read_sql(query,db)

   rank      country    density  population  aria
0     1   Uzbekistan  1245.2568        36.0    44
1    35  Qirgiziston   421.2356        16.0    23
2    21   Tajikistan   124.1225        52.1    36

In [28]:
query = "SELECT name FROM sqlite_master WHERE type='table';"
cursor.execute(query)
cursor.fetchall()

[('yonalish',), ('yonalish1',), ('aholi_soni',)]

In [29]:
query = "DROP TABLE yonalish1;"
cursor.execute(query)
db.commit()

In [30]:
db.close()